IDEA Open Model
BeamDataEc2.CheckLimitDeflection Property
Compatible with IDEA StatiCa Beta 20.0
 indicator for check of limit deflection for beam span
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public bool CheckLimitDeflection { get; set; }
Public Property CheckLimitDeflection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace